Revit 2027 API
BuiltInFailures.ComponentRepeaterFailures.ComponentRepeater_InvalidFamilyOnReload Property
 Reloaded family not appropriate for repeater.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ComponentRepeater_InvalidFamilyOnReload { get; }
Public Shared ReadOnly Property ComponentRepeater_InvalidFamilyOnReload As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ComponentRepeater_InvalidFamilyOnReload {
	FailureDefinitionId^ get ();
}
static member ComponentRepeater_InvalidFamilyOnReload : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ComponentRepeaterFailures Class
Autodesk.Revit.DB Namespace